package com.lmt.lib.bldt;

/**
 * 難易度表の状態を表す列挙型です。
 *
 * @since 0.4.0
 */
public enum TableStatus {
	/**
	 * 難易度表の更新が不定期で行われていることを表します。
	 * <p>難易度表の運営体制は、その難易度表ごとに異なるため更新頻度については保証されません。
	 * 更新は1年以上にわたって行われないことがありますが、その状態であってもこの値を示すことがあります。</p>
	 */
	ACTIVE,

	/**
	 * 難易度表の運営から更新停止がアナウンスされたか、長期間更新が行われていないことを表します。
	 * <p>この値を示す場合、将来にわたって難易度表が更新される見込みがないと推定されます。
	 * ただし、運営から正式に更新停止がアナウンスされない限り更新が再開される可能性があります。
	 * ここで言う「長期間」とは、概ね3～5年程度を目安と考えてください。</p>
	 */
	FROZEN,

	/**
	 * 難易度表の状態が不明であることを表します。
	 * <p>{@link DifficultyTables#add(TableDescription)} でユーザーによって追加された難易度表がこれに該当します。</p>
	 */
	UNKNOWN;
}
